[{"url": "https://ko.com.ua/garantiya_vsebichnogo_bagatorivnevogo_zahistu_vid_bitdefender_140068", "title": "Гарантія всебічного багаторівневого захисту від Bitdefender ", "img": "https://ko.com.ua/files/u16/bitdefender45.jpg", "body": "\n+22голоса\n\n\n\n\nTweet\n\n\n\n\n\nЗростання загроз кібербезпеки та переповнений ринок технологій змушують компанії боротися за захист своїх клієнтів та співробітників. Організації все частіше стикаються з атаками, які загрожують їх здатності захистити дані користувачів та систему в цілому. Від більш складних векторів атак та відсутності кваліфікованих фахівців з безпеки до зростання цифровізації та популярності віддаленої роботи – ці тенденції викликають потребу у більш ретельній кібербезпеці.\nРозробка надійної схеми безпеки допоможе посилити інформаційний захист та досягти бізнес-цілей через складніший ландшафт безпеки та технологій. Для цього у проекті мають бути розглянуті технології, які працюють разом для створення комплексної пропозиції та вимірювання прогалин у безпеці.\n\n\n Передові технології для забезпечення захисту\nСтруктури та моделі кібербезпеки неймовірно важливі та забезпечують послідовний набір посібників, принципів та стандартів, яким керівники служб безпеки можуть слідувати та використовувати для побудови своїх дорожніх карт.\nВажливим питанням для кожної компанії є захист особистості та бізнесу від будь-якого стороннього втручання. Комплексний антивірус Bitdefender 2022 використовує передові технології для безпеки комп'ютерів, захисту від вірусів та загроз. А ще сприяє нейтралізації різноманітних шкідливих програм, у тому числі нових варіантів шифрувальників та повністю підтримує операційну систему Windows 11.\n“Bitdefender дотримується політики безперервного технологічного розвитку, регулярно оновлює систему та впроваджує вдосконалені засоби захисту. Все це дозволяє антивірусу Bitdefender виявити і заблокувати навіть найновітніші інтернет-загрози. Bitdefender – провідна компанія в галузі розробки антивірусних програм та кіберзахисту”, – розповідає Олександр Бутусов, Head of Information Security Solutions компанії SOFTICO.\nЦікаво, що Bitdefender – це не просто програма з виявлення шкідливого ПЗ на комп'ютері. Антивірус має інтелектуальну систему сканування, яка включає в себе новітні інноваційні розробки в кібербезпеці. \n Рекомендації та основні методи безпеки\nПлан безпеки повинен гарантувати стратегію надання всебічного багаторівневого захисту та відстежувати основні загрози, з якими клієнти та співробітники можуть щодня стикатися. Цей багаторівневий підхід необхідно поєднувати з нульовою довірою до безпеки, який гарантує, що весь внутрішній та зовнішній трафік вважається ненадійним, доки він не буде перевірений.\nГлибока оборона. Дуже важливо створити серію технологічних рівнів, які утворюють основу кібербезпеки. Сюди входять такі елементи, як аналіз ризиків, посилення захисту та скорочення поверхні атаки, виявлення та реагування, технології запобігання та розширений захист від нових загроз (шкідливе ПЗ та програми-вимагачі). Слід вбудувати кероване виявлення та реагування для цілодобового запобігання та пошуку загроз для попереджуючого виявлення зловмисників, що ховаються.\nЄдине рішення безпеки. Уніфіковане рішення безпеки дозволяє об'єднати якнайбільше цих технологічних рівнів в одну систему. В результаті, можна підтримувати конкретні потреби своїх клієнтів через єдину точку управління.\nЗрілі алгоритми штучного інтелекту та машинного навчання. Рішення, які засновані на зрілих алгоритмах штучного інтелекту (AI) та машинного навчання (ML), перевіряються на відповідність цілям у незалежних тестах. Це допоможе надати клієнтам рішення, що відповідають їхнім вимогам.\nІнтеграція технологій. Оскільки зловмисники використовують широкий спектр методів кібератак, вони можуть легко перемикати вектори, щоб обійти захист безпеки організації. Забезпечення інтеграції рішень та ефективної взаємодії між ними має вирішальне значення для успіху проекту безпеки.\n Основний функціонал Bitdefender 2022\n    • Bitdefender VPN забезпечує повну анонімність в Інтернеті завдяки шифруванню вашого з'єднання з глобальною мережею.\n    • Network Threat Prevention зупиняє атаки ще до початку, виявляючи експлойти на мережному рівні.\n    • Ransomware Remediation – це нова технологія, що забезпечує захист від атак програм-вимагачів нульового дня.\n    • Розпізнавання невідомих вірусів та автоматичне створення резервних копій вихідних файлів та відновлення даних після усунення небезпеки.\n    • Bitdefender Autopilot – ваш радник з безпеки. Надає контекстні рекомендації на основі використання вашого пристрою та потреб.\n    • Контролює з'єднання брандмауером та запобігає вторгненням у комп'ютер.\n    • Покращені модулі Advanced Threat Defense та Web Attack Prevention.\n    • Розширений функціонал батьківського контролю.\n\nМатеріал підготувала компанія SOFTICO – рішення з інформаційної безпеки, постачання та ліцензування програмного забезпечення від світових лідерів, CAD-рішення, IT-сервіси з інтеграції та обслуговування.\nDell PowerStore – абсолютная готовность к инновациям в IT\n+22голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["24", "января"], "time": null}, {"url": "https://ko.com.ua/upravlinnya_okeanom_danih_yak_zahistitisya_vid_kiberzlochinciv_140025", "title": "Управління океаном даних: як захиститися від кіберзлочинців ", "img": "https://ko.com.ua/files/u16/acronissoft1.jpg", "body": "\n+22голоса\n\n\n\n\nTweet\n\n\n\n\n\nЗагроза витоку даних – те, що не дає спати ночами фахівцям із кібербезпеки. У наші дні організації всіх напрямів залежать від даних, які вони зберігають. Це інформація про співробітників та клієнтів, внутрішні документи, код додатків, вміст поштових серверів та багато іншого. Зрозуміло, що всі ці дані не повинні потрапити до рук злочинців.\nВитік інформації може зашкодити репутації компанії або означатиме правові та фінансові ризики. Тому цілком очевидно, що захист даних – найважливіша умова забезпечення безперервної роботи будь-якої компанії.\n Важливість офлайн-бекапів\nУ травні 2021 року хакери атакували мережі енергетичної компанії Colonial Pipeline та м'ясопереробної компанії JBS, зашифрувавши їх дані. Організації, не маючи доступу до мережевих ресурсів та побоюючись подальшої компрометації, вирішили зупинити роботу своїх мереж. Внаслідок чого виробництво на певний час припинило свою діяльність, що призвело до збитків. На жаль, більшість компаній у подібній ситуації вимушені робити так само.\n\n\nНагадаємо, що в ніч з 13 на 14 січня 2022 року хакери атакували близько 70 сайтів органів державної влади України. У Держспецзв'язку додали, що це була більш висока складність атаки, ніж модифікація стартових сторінок веб-сайтів. Низку зовнішніх інформаційних ресурсів було знищено зловмисниками у ручному режимі.\nОдне з рішень, що дозволяє протистояти атакам шифрувальників та здирників, представлене саме офлайн-бекапами. Якщо організацію атакували – ці резервні копії даних залишаються недоторканими. У наведеному вище прикладі зловмисники, озброївшись програмою-вимагачем, зашифрували дані, доступні по мережі, не давши співробітникам організацій та іншим зацікавленим особам нормально працювати. У такій ситуації компаніям пропонують розглянути питання виплати викупу. Оскільки, якщо цього не зробити, то масштаби проблеми для організації можуть перерости від тимчасового простою до повного банкрутства.\nЯкщо в компанії є офлайнові серверні бекапи, то відновлення даних виконується доволі швидко. На виконання цієї процедури, звичайно, знадобиться деякий час, але терміни вже залежать від розмірів компанії. Раніше офлайнові бекапи були обмежені використанням локальних серверів, проте тепер хмарні сервіси резервного копіювання даних пропонують SMB-доступ до віддалених серверних рішень, що масштабуються.\n\n Ринок систем для серверного бекапу\nАналітики оцінили обсяг глобального ринку серверного резервного копіювання даних у 2021 році приблизно у 5 млрд доларів США. До 2026 обсяг цього ринку може подвоїтися. Цей тренд вказує й на те, що бізнесу потрібні засоби для управління даними, яких стає все більше, а також з'являється необхідність термінового захисту того, що є найціннішим.\n“Послуги провайдерів хмарних служб були і залишаються популярними під час вирішення таких завдань, як зберігання, синхронізація, резервне копіювання даних. І якщо звичайним користувачам знайомі такі назви, як Dropbox, Google Drive та iCloud, бізнесу варто піти далі за загальновідомі сервіси для того, щоб захистити свої дані. Для організацій вкрай важливою є можливість хмарних платформ із безперервної синхронізації змін та з автоматичним створенням резервних копій даних”, – говорить Лариса Куроєдова, СЕО компанії SOFTICO, ексклюзивного дистриб’ютора продуктів Acronis в Україні.\nВеликі і досить відомі компанії вже багато років беруть на себе основний удар кібератак, бо дані водночас можуть бути як активом, так і вразливим місцем для організацій. Існує безліч ризиків, пов'язаних із втратою важливої інформації, і жодна компанія не може бути повністю від такого захищена. Віддалені офлайнові бекапи в організаціях різних сфер – це найважливіша частина захисту інформаційних систем, здатна допомогти їм пережити чергове лихо.\n\n\n“Продукти Acronis дозволяють постачальникам послуг надавати кібербезпеку простим, ефективним і безпечним способом. Зазначу, що Acronis – найпростіше і найшвидше рішення, яке налаштовується для резервного копіювання та відновлення даних, управління сховищем і захисту від шкідливого ПЗ для будь-якої конфігурації системи”, – розповідає Олександр Бутусов, Head of Information Security Solutions компанії SOFTICO.\n Ось що можна порадити тим, хто хоче захистити дані своєї компанії:\n    • Проведіть ретельну інвентаризацію мережевих компонентів (хмарних ресурсів, програмного та апаратного забезпечення).\n    • Оцініть та запишіть відомості про обсяги даних для різних сегментів мережі.\n    • Ідентифікуйте дані, які обов'язково треба зберегти, та ті, які можна видалити без проблем.\n    • Переконайтеся, що всі системи, пристрої та працівники дотримуються корпоративних норм і стандартів.\n\n Бекапи: підготовка до найгіршого\nГлобальна економіка дедалі більше залежить від даних. Великі масиви інформації знаходяться в самому серці всього того, чим ми займаємося в цифровому світі. Дані організацій коштують великих грошей і кіберзлочинці про це добре знають. Природні катаклізми – явище рідкісне, проте є цифрові загрози: злочинці, шкідливе програмне забезпечення і людські помилки. Саме тому бекап-служби – це надзвичайно важлива частина інформаційного захисту.\n\nТим, хто відповідає за безпеку даних в організації, варто якнайшвидше підготуватися до найгіршого та оцінити, яка саме цінна інформація є в компанії, чи виконуються серверні бекапи, та як планується відновлювати роботу після виникнення надзвичайної ситуації.\n\n Матеріал підготувала компанія SOFTICO – рішення з інформаційної безпеки, постачання та ліцензування програмного забезпечення від світових лідерів, CAD-рішення, IT-сервіси з інтеграції та обслуговування.\nDell PowerStore – абсолютная готовность к инновациям в IT\n+22голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["18", "января"], "time": null}, {"url": "https://ko.com.ua/rezervirovanie_pamyati_resurs_i_proizvoditelnost_ssd_139993", "title": "Резервирование памяти, ресурс и производительность SSD", "img": "https://ko.com.ua/files/u16/ssd1q111.jpg", "body": "\n+33голоса\n\n\n\n\nTweet\n\n\n\n\n\nИзменение размера служебной области влияет на срок службы SSD и производительность записи случайного доступа.\nРесурс SSD на флэш-памяти NAND определяется количеством циклов записи и стирания, которые накопитель выдерживает в своем жизненном цикле. Вне зависимости от типа памяти, имени производителя  и контроллера SSD, к деградации ячеек NAND причастны такие внутренние процессы как сбор мусора (garbage collection) и усиление записи (write amplification). Самым же действенным средством  продления срока службы твердотельных накопителей является увеличение области служебных ячеек, избыточное резервирование памяти (overprovisioning). Все это давно и подробно описано. В коротком пересказе — так.\n Garbage collection (GC)\nПамять NAND разбита на блоки, те – на страницы. Напрямую записать данные во флэш-память по физическому адресу невозможно. Контроллер SSD  пишет обновленные данные на свободные страницы, помечая исходные как недействительные. Транслятор адресов перенаправляет логические адреса обновлений на новые физические адреса. Стереть страницу с данными, потерявшими актуальность (мусор) нельзя, можно только целый блок. Чтобы освободить, сделать доступным для ОС пространство памяти под неактуальными данными, надо для начала переместить действительные данные соседних страниц освобождаемого блока на страницы в другом блоке.  Это и есть GC, процесс сбора достоверных данных в рабочие блоки с последующим стиранием мусорных.\n Write amplification (WA)\nКогда по мере заполнения у SSD остается мало свободных блоков, каждая операция записи приводит к серии перемещений данных контроллером – чтобы собрать их в состоятельные блоки и выкроить запас пространства удалением мусора. В результате, объем записи в ячейки флэш-памяти  (включая копирование действительных данных во время GC) может в разы превышать объем посылки записи хоста. Усиление записи WA - отношение этих объемов. Оно зависит от профиля рабочих нагрузок. Как правило, случайная запись коротких фрагментов множит записи гораздо сильнее, чем последовательная запись больших: данные случайного доступа сильнее фрагментированы, для сбора распыленного мелкого мусора нужно больше операций.\n Overprovisioning (OP)\nДля свободы маневра «мусорщика» из общего пространства памяти SSD выделяют область OP, доступную контроллеру SSD, но недоступную хосту.  Этот резерв служебных ячеек памяти NAND используется как промежуточное поле для перемещения данных GC, выравнивания износа и подмены битых ячеек. Производитель SSD сам назначает размер OP, уменьшая пользовательскую емкость SSD. Есть общепринятые номиналы (как 256GB или 240GB), но могут  быть любые:\n\n\nЭто поясняет многообразие SSD, когда из-под рук одного и того же вендора выходят накопители на одном и том же контроллере, но с разными паспортными показателями. \nЛогику разметки OP легко представить себе на примере игры в «пятнашки». Кабы на поле была не одна свободная ячейка, а больше (например, коробка 5х5 вместо 4х4), те же костяшки от 1 до 15 вышло бы упорядочить за меньшее число ходов. Так и с усилением записи SSD: чем больше служебный резерв памяти -  тем оно меньше.\n\n\n Износ ячеек\nПользователю интересна не так механика процесса, как прогноз живучести SSD – в терминах объема суточной перезаписи (DWPD) или, что более корректно, общего объема перезаписи на протяжении жизненного цикла (TBW).  Среднестатистическая устойчивость к износу (endurance), которую мы видим в паспортах SSD,  рассчитывается по стандартам JEDEC. Для серверных  накопителей – на корпоративных шаблонах с нагрузками произвольного доступа.\n\n\nПрогноз TBW повышается с увеличением OP, но нелинейно. С определенного момента добавление OP не приводит к заметному приросту ресурса, скорее, снижает пропускную способность SSD. Подходящий размер области резерва для фактического приложения выбирают, оценивая характер и интенсивность нагрузок, в том числе в подобных задачах на старых серверах. \n Производительность SSD\nПроизводительность случайной записи максимальна на свежем накопителе. В процессе его заполнения данные становятся все более фрагментированными, а контроллер SSD тратит больше времени на сбор мусора – основной фактор снижения производительности. Увеличение OP уменьшает WA, контроллер быстрее освобождает страницы под запись и оперативно отрабатывает запросы хоста, когда SSD близок к насыщению операциями записи.\n\n\n Все в руках пользователя\nРазмер OP не является постоянным свойством SSD, неодолимым препятствием для управления ресурсом и производительностью. У всех основных вендоров есть утилиты, позволяющие контролировать различные  параметры SSD. В том числе, менять размер области служебных ячеек серверных накопителей – ровно так же, как это делается на фабрике.\nВот как описывает Kingston процедуру разметки из приложения SSD Manager: \n    • Overprovisioning —практика уменьшения полезной емкости SSD для повышения как его ресурса, так и производительности. Избыточное выделение ресурсов устанавливается параметром Host Protected Areca (HPA).\n    • Эта функция поддерживается только твердотельными накопителями Kingston серии Data Center\n    • Сначала удалите все разделы с SSD. Очистите SSD с помощью diskpart. Для лучшей производительности рекомендуется безопасное стирание.\n    • Введите желаемую емкость в гигабайтах (ГБ) и последние четыре цифры серийного номера SSD. После модификации HPA и перезагрузки система распознает новую емкость диска. \n Знай меру\nПрограммные средства управления ресурсом и производительностью SSD увеличивают свободу действий пользователя – ценное качество во времена плохой доступности различных номиналов накопителей. Вместо долгого ожидания поставки экзотических Write Intensive SSD (5-10 DWPD) достаточно купить доступные Mixed Use (1-3 DWPD) и разметить их на меньшую емкость.\nОптимальный размер OP зависит от приложения. Для рабочих нагрузок с интенсивной записью случайного доступа полезно пожертвовать частью емкости для увеличения срока службы и прироста производительности. Там где преобладает чтение, расточительность неуместна.\nDell PowerStore – абсолютная готовность к инновациям в IT\n+33голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "Андрей Тищенко", "date": ["15", "января"], "time": null}, {"url": "https://ko.com.ua/dell_powerstore_absolyutnaya_gotovnost_k_innovaciyam_v_it_139968", "title": "Dell PowerStore – абсолютная готовность к инновациям в IT", "img": "https://ko.com.ua/files/u16/.баннер-DELL-PowerStore_cтатья_1200на628.jpg", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nС момента анонса Dell PowerStore - решение высокого класса для хранения данных, стабильно демонстрирует высокую динамику развития. О чем говорят как растущие глобальные продажи данной системы, так и те усилия, которые прикладывает вендор для развития этой линейки.\nВ апреле 2021 г., спустя почти год с момента выхода платформы на рынок, произошло два знаковых события. Первое из них – выход большого обновления программного обеспечения PowerStoreOS (так называемое обновление PowerStoreOS 2.0), под управлением которого функционируют СХД. Второе – выход на рынок новой аппаратной платформы для PowerStore, в виде новой, самой младшей модели – PowerStore 500T.\n\nВ обновление программной составляющей - PowerStoreOS вошло достаточно большое количество новшеств. Кратко остановимся на основных из них.\nНовая версия PowerStoreOS обеспечила значительное увеличение производительности для каждой модели в семействе. В реальных рабочих нагрузках показатели количества операций ввода-вывода в секунду (IOPS) выросли до 25%. Такой прирост обеспечивается тщательной оптимизацией алгоритмов работы программного обеспечения.\nТо, что компания обещала на старте продаж PowerStore - полная поддержка протокола NVMe-over-Fibre Channel – также было реализовано в этом обновлении. Поддержка данной технологии обеспечивает возможность использования современных высокопроизводительных носителей данных NVMe с максимальной эффективностью. Стоит отметить, что задержки (latency) при обращении к накопителям NVMe в составе дискового массива настолько же низкие, как и в случае использования локальных дисков NVMe непосредственно в составе серверов.\nТакже, была реализована анонсированная возможность кластеризации нескольких устройств для моделей PowerStore X. Теперь и семейства PowerStore T, и PowerStore X могут быть горизонтально масштабированы до восьми узлов (или – 4 различных модели в пределах семейства). Благодаря этому существующий функционал AppsON, дающий возможность запускать виртуальные машины и приложения непосредственно на СХД, теперь может функционировать в кластере из нескольких массивов PowerStore Х.\nЗа счёт усовершенствования и оптимизации механизма дедупликации и компрессии данных, PowerStoreOS теперь также учитывает и уровень утилизации контроллеров СХД. В периоды экстремальной нагрузки на подсистему ввода-вывода, встроенная дедупликация PowerStore будет временно отложена, чтобы снизить нагрузку на процессоры массива. При этом система отслеживает любые «пропущенные блоки» и вернётся к их автоматической обработке позже, когда нагрузка на контроллеры СХД будет снижена. Таким образом, удаётся почти полностью уйти от влияния на производительность массива со стороны процессов оптимизации хранимых данных. При этом гарантированный производителем средний коэффициент «Data Reduction» составляет все те же 4:1.\nБлагодаря улучшению технологии Dynamic Resiliency Engine (DRE) для дополнительного резервирования критичных данных теперь может использоваться механизм двойной четности. Выбор такого уровня защиты данных позволяет обеспечить их доступность в случае одновременного выхода из строя двух дисков SSD.\nИзменения произошли и в части использования накопителей Storage Class Memory (SCM). В отличие от подавляющего большинства существующих на рынке решений, PowerStore всегда поддерживал SCM для постоянного хранения данных, а не только для их кэширования. И теперь, массивы PowerStore получили ещё одну возможность использования накопителей SCM - для увеличения скорости доступа к метаданным. Причем система сама определяет, какие диски – NVMe и/или SCM есть в ее распоряжении – и перераспределяет данные и метаданные соответствующим образом, обеспечивая максимально эффективный доступ к их данным, размещенным на них.\nТакже необходимо обратить внимание, что все перечисленные выше преимущества обеспечиваются простым обновлением системного ПО PowerStoreOS, без прерывания работы массива или доступа к его данным. Поэтому их также получают и те клиенты, которые успели приобрести PowerStore ранее – в рамках действия сервисного контракта на поддержку.\nСтоит отметить, что благодаря вполне доступной цене, младшая модель PowerStore 500T вызвала живой интерес у большого количества заказчиков. \nТакже, как и ее старшие модели, эта система поддерживает кластеризацию до четырех устройств PowerStore, причём кластер может состоять из разных моделей семейства PowerStore Т.\nНапример, к массиву PowerStore 500T можно подключить в кластер до трех таких же массивов, что позволит получить до 4,8 ПБ эффективной ёмкости. Если же в составе кластера сочетать и другие модели семейства PowerStore T - это может дать до 9,8 ПБ эффективной ёмкости. Такая возможность предоставляет чрезвычайную гибкость и запас для увеличения не только дисковой ёмкости, но и производительности по мере того, как растут потребности компании при развитии бизнеса.\n\nТакже необходимо подчеркнуть, что линейка PowerStore в максимальной степени готова и для внедрения таких инновационных направлений, как контейнеризация приложений. На этом вопросе хотелось бы остановиться подробнее. \nВ течение многих лет архитектура приложений сохранялась монолитной. Традиционные типы приложений обладают большой мощностью и эффективностью, и работают на виртуальных машинах. Однако, такие приложения достаточно сложны в задачах администрирования, имеют длительное время загрузки.\nВ отличие от монолитной архитектуры, в облачных приложениях необходимые компоненты сегментируются на микросервисы, которые затем объединяются и развертываются с помощью контейнеров. Это даёт возможность независимо обновлять и масштабировать облачные приложения. \nОба подхода присутствуют в сегодняшних современных приложениях, но скорость и гибкость облачных - повсеместно меняют приоритеты в свою пользу.\nПри этом платформа Kubernetes выступает в качестве отраслевого стандарта, который позволяет успешно решать такие задачи, как: автоматизация операций развертывания, масштабирование и управление контейнерными приложениями, поиск дополнительных сервисов, балансировка нагрузки и управление хранилищами.\n\nЭкосистема Kubernetes быстро растет, как можно видеть на приведенном ниже графике. Ожидается, что к 2025 году до 70% предприятий будут использовать Kubernetes. При этом 54% таких нагрузок ​​будут развернуты в производственной среде предприятия, непосредственно в его дата-центре.\n\n\nНо, не все так радужно. Kubernetes создает множество проблем, среди которых:\n    • Сложный регламент внутренних согласований, из-за которого команда DevOps зачастую предпочитает использовать ресурсы публичного облака, вместо утилизации существующей IT-инфраструктуры (например, в этом случае разработчикам совершенно не нужно задумываться откуда им будут предоставлены ресурсы). \n    • Усложнение работы администраторов из-за отсутствия прозрачности и мониторинга контейнерных нагрузок, а также соблюдения требований доступности, безопасности и соблюдения нормативных требований.\n    • Kubernetes не может автоматически гарантировать, что ресурсы правильно распределяются между различными рабочими нагрузками - необходима ручная настройка квот ресурсов.\n\nЗачастую, разработчики не акцентируют своё внимание на присутствие в локальной IT-инфраструктуре централизованных систем хранения данных. При этом именно такие системы способны обеспечить выдающиеся показатели производительности, надёжности и эффективности.\nИзящный способ решения вопроса - интеграция дисковых массивов с Kubernetes CSI (Container Storage Interface) API. Соответствующие плагины CSI позволяют предоставить блочные и файловые системы хранения для контейнерных рабочих нагрузок.\nБлагодаря наличию Container Storage Modules (CSM) дисковые массивы Dell расширяют возможности хранилища Kubernetes за пределы того, что по умолчанию доступно в спецификации CSI.\nЭто снижает сложность управления, поэтому разработчики могут с легкостью самостоятельно использовать корпоративное хранилище и автоматизировать повседневные операции, такие как: выделение ресурсов, создание моментальных снимков, репликация, контроль, авторизация на основе ролевого управления доступом, отказоустойчивость. Модуль CSM имеет открытый исходный код и свободно доступен. \nКонечные эффекты от использования такой интеграции - ускорение развертывания приложений и укрепление роли корпоративного хранилища как жизнеспособной альтернативы публичному облаку.\nУказанная функциональность применима к широкой номенклатуре систем хранения от Dell и затрагивает не только PowerStore, но и PowerScale, PowerMax, PowerFlex, Unity XT.\nВ частности, массивы PowerStore поддерживают интеграцию с широким спектром платформ для контейнеризации: Kubernetes, Red Hat OpenShift, Mirantis Kubernetes Engine, Google Anthos, VMware Tanzu, Rancher Kubernetes Engine.\nМожно с уверенностью констатировать, что, выбирая массивы PowerStore от Dell, Заказчик не будет ограничен в технологиях не только сегодняшнего, но и завтрашнего дня. \n В заключение отметим, что специалисты компании AM-BITS, платинового партнера Dell Technologies, имеют большой опыт внедрения проектов разного масштаба и всегда готовы оказать содействие в выборе оптимальной модели и конфигурации СХД под конкретные бизнес-задачи.\n\n \nКлиенты AM-BITS имеют возможность протестировать сам продукт Dell PowerStore в нескольких вариантах. Например, по программе Try&Buy, когда оборудование настраивается на заводе производителя под задачи заказчика и отправляется после этого на тестирование (до 3 месяцев) с возможностью вернуть (по предварительным условиям договора тестирования). Другой вариант — компания может заказать Dell PowerStore как демо-оборудование до 2-4 недель, при этом конфигурация платформы не меняется. Детали на https://am-bits.com/dell-powerstore-2 \nСтатья подготовлена компанией AM-BITS.\nПри подготовке публикации использовались материалы ресурса «Itzikr's Blog»\n \nПубликуется на правах рекламы\n\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["13", "января"], "time": null}, {"url": "https://ko.com.ua/programmnyj_nvme_raid_prosto_i_bystro_139830", "title": "Программный NVMe RAID: просто и быстро", "img": "https://ko.com.ua/files/u16/image3 NVMeRAID.jpeg", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nПротокол NVMe придумали, чтобы убрать посредников между SSD и CPU. Без аппаратных RAID-контроллеров серверы получаются производительнее, проще, дешевле.\nПеревод серверов на NVMe SSD сдерживает не цена накопителей, а консерватизм пользователей и бремя привычной программной инфраструктуры. Ограничения (и самоограничения) мешают добиваться продуктивности дискового ввода-вывода в серверах приложений и баз данных – ведь источником производительности являются не контроллеры RAID, а ресурсы современных многоядерных процессоров и широких шин доступа к данным на скоростных носителях.\n\nВедущие поставщики серверного оборудования не обсуждают массовое применение NVMe SSD в серверах еще и потому, что с их точки зрения для производительного хранения нужно покупать (дорогостоящие) системы хранения и не забивать себе голову рукоделием. А мы попробуем.\nОбъективно, организация дисков в массив является самой сложной проблемой хранения. Для NVMe SSD доступны следующие решения:\n    • Аппаратные трехрежимные (Tri-Mode) RAID-контроллеры (Broadcom, Microchip, Areca)\n    • Полу-программный Intel VROC\n    • Программный RAID средствами базовых ОС (Linux, Windows)\n    • Сторонние коммерческие или бесплатные программные сборки (например, RAIDIX ERA)\n    • \nАппаратные RAID-контроллеры плохи тем, что пропускают поток данных через стек SAS и узкое горло шины (8-16 линий PCIe). При этом стоят немалых денег и неудобны в подключении. Intel VROC требует аппаратных ключей (поди найди) и не дает выигрыша в производительности. Программный RAID уменьшает число потенциальных точек отказа в сервере и зависимость от железа. Насколько он выгоден и производителен, зависит от реализации массива: RAID 10 «расточителен», RAID 5 и 6 «тупят». Но варианты маневра есть.\nКак сделать быстро и наименее затратно?\nСравним два программных NVMe RAID: созданный стандартной утилитой Linux mdadm и собранный RAIDIX ERA. \nRAIDIX ERA – управляющая утилита, работающая поверх ядра Linux и предоставляющая массив NVMe приложениям сервера в виде блочного устройства. Может использоваться с локальными дисками и удаленными накопителями (NVMe JBOF). Задействует расширенное поле регистров CPU для параллельных вычислений – что мобилизует ресурсы процессора, щадит оперативную память и минимально просаживает производительность в режиме смешанной нагрузки. Лицензия RAIDIX ERA бесплатна для 4 накопителей, это усилило интерес к продукту.\n Тестовое ложе\nПод установку нескольких NVMe нужна платформа U.2-ready. Мы взяли такую: https://servers.asus.com/products/servers/rack-servers/RS500A-E10-RS12U#Specifications, под один AMD EPYC. \nКонфигурация стенда:\n    • AMD EPYC 7413P 24 cores 2.65GHz\n    • ASUS RS500A-E10-RS12-U \n    • 4 x DDR4-3200 32GB reg Samsung {M393A4G40AB3-CWEGQ}\n    • 240GB M.2 NVMe SSD Kingston DC1000B {SEDC1000BM8/240G} boot SSD\n    • 4 x  960 GB SSD WD Ultrastar SN640 {0TS1849} U.2 SSD\n    • Ubuntu 18.04\n    • RAIDIX ERA 3.4\n\n\nПроизводительность дисковой системы замеряли утилитой fio (Flexible I/O tester) для нагрузок с произвольным и последовательным доступом:\n\n\nЧетыре NVMe собирали в массивы уровней RAID 10 и RAID 5.\n\n\n Создание RAID-массива утилитой mdadm\nПроверка дисков:\n cat /proc/mdstat\n\n\n lsblk -o NAME,SIZE,FSTYPE,TYPE,MOUNTPOINT\n\n\nВидим 4 NVMe SSD. Проверяем наличие разделов на этих дисках (нам не нужны прежние метаданные):\nfdisk –l\n\n\nДиски чисты. Собираем их в RAID10:\nsudo mdadm --create --verbose /dev/md0 --level=10 --raid-devices=4 /dev/nvme0n1 /dev/nvme1n1 /dev/nvme2n1 /dev/nvme3n1 \n\n\nКонтролировать процесс создания массива можно, просматривая содержимое файла /proc/mdstat:\n cat /proc/mdstat\n\n\nВидны скорость формирования массива и время до его окончания.\nФормирование закончено, RAID md0 сформирован:\n\n\nСоздаем и монтируем файловую систему ext4:\n sudo mkfs.ext4 -F /dev/md0\n\nСоздаем точку монтирования:\nsudo mkdir -p /mnt/md0\nМонтируем файловую систему:\nsudo mount /dev/md0 /mnt/md0\nПроверяем доступность и объемы дисков:\ndf -h -x devtmpfs -x tmpfs\n\n\nЧтобы обеспечить автоматическую сборку массива при загрузке, необходимо изменить файл /etc/mdadm/mdadm.conf. Подключить файл и обновить начальную файловую систему RAM возможно командами:\nsudo mdadm --detail --scan | sudo tee -a /etc/mdadm/mdadm.conf\nsudo update-initramfs -u\n\n\nАвтоматического монтирования при загрузке можно добиться, добавив новые параметры в файл etc / fstab:\n echo '/dev/md0 /mnt/md0 ext4 defaults,nofail,discard 0 0' | sudo tee -a /etc/fstab\n\n\nПерегружаем систему. Проверяем cмонтированный RAID:\ndf -h\n\n\nДетальная информация о RAID-массиве по команде:\nmdadm -D /dev/md0\n\nМассив RAID5 создается точно так же, для начала надо удалить с дисков следы прошлого.\nДемонтаж и останов массива:\numount /dev/md0\nmdadm -S /dev/md0\nЗатираем диски:\ndd if=/dev/zero of=/dev/nvme0n1 bs=1M count=1024\ndd if=/dev/zero of=/dev/nvme1n1 bs=1M count=1024\ndd if=/dev/zero of=/dev/nvme2n1 bs=1M count=1024\ndd if=/dev/zero of=/dev/nvme3n1 bs=1M count=1024\nДалее проверяем доступность дисков для создания RAID и повторяем все описанные шаги.\nRAID-массив можно собрать и по-другому, из графической оболочки Webmin.\n Создание RAID-массива утилитой RAIDIX ERA\nCоберем RAID 10. Проверяем диски:\nlsblk\n\nСоздаем RAID:\neraraid create -n ERA10 -l 10 -d  /dev/nvme0n1 /dev/nvme1n1 /dev/nvme2n1 /dev/nvme3n1 -bs 512\neraraid show\n\ninit_progress – прогресс инициализации: от 0% до 100%.\nИспользуя параметр –e, можно посмотреть расширенную информацию о RAID-массиве:\n\nИнициализация RAID заняла намного меньше времени, чем при использовании mdadm.\nСоздаем точку монтирования:\n sudo mkdir -p /mnt/era\nУстанавливаем файловую систему xfs:\n sudo mkfs.xfs /dev/era_ERA10\nМонтируем файловую систему:\nsudo mount /dev/era_ERA10 /mnt/era\nПроверяем доступность и объем дисков:\ndf -h -x devtmpfs -x tmpfs\n\n\nRAID 5 строится аналогично RAID 10.\n Выборочные тесты\nКонтрольный прогон RAID-массивов из четырех NVMe SSD показал их более чем пристойную производительность – при том, что для  построения использовались бесплатные утилиты, без тонких настроек. \n\n \n\n\nВсе RAID 10 даже при больших нагрузках произвольного доступа работают с задержками ниже 1 мс. Чем выше интенсивность операций – тем больше раскрывается потенциал RAIDIX ERA.\nCравнили RAID 5 под mdadm и ERA на последовательных операциях ввода-вывода, c размером блока 128К.\n\nПроизводительность чтения примерно одинакова, по скорости записи RAIDIX ERA заметно превосходит оппонента. \n Что с того?\nВообще говоря, сравнивать показатели различных реализаций NVMe RAID мы не собирались – таких тестов хватает. Производительности даже скромных программных массивов из четырех SSD достаточно массовым приложениям – и это серьезный аргумент в размывании стереотипов. Следуя принципу бережливости (бритва Оккама: «не следует множить сущее без необходимости»), в серверах с локальными NVMe-дисками можно обходиться без аппаратных контроллеров. Тем более  когда альтернатива бесплатна. \nЗа NVMe будущее, нет сомнений. Избавление от RAID-контроллеров в серверах – часть пути в это, программно-определяемое будущее. Инструменты есть.\nDell PowerStore – абсолютная готовность к инновациям в IT\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "Игорь Дражан", "date": ["2021", "г."], "time": null}, {"url": "https://ko.com.ua/thycotic_-_lider_v_oblasti_kontrolya_privilegirovannyh_polzovatelej_139889", "title": "Thycotic - лидер в области контроля привилегированных пользователей", "img": "https://ko.com.ua/files/u16/Thycotic - лидер PAM.png", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nСейчас ИТ-команды сталкиваются с постоянно развивающейся и расширяющейся инфраструктурой, особенностью которой является перемещение удаленной рабочей силы, увеличение политик BYOD, расширение поверхности атаки и увеличение использования облачных сервисов. Пользователи и конечные точки покинули офис, и теперь их намного сложнее анализировать, управлять и поддерживать, в соответствии с нормативными требованиями.\nЭто не оставляет ИТ-отделам иного выбора, кроме как относиться ко всем пользователям, как к привилегированным, а значит, собирать и анализировать данные обо всех без исключения. В результате чего, в организациях увеличивается отслеживаемое количество пользователей в два, а то и в три раза, и в такой ситуации нужна отдельная система контроля, которая могла бы эффективно решить проблемы безопасности.\n\n\nУправление привилегированным доступом возможно благодаря машинному обучению и искусственному интеллекту - отделы безопасности могут активно вести непрерывный мониторинг действий, обнаружение угроз с возможностью быстрой реакции в считанные минуты. В этом отношении решения ThycoticCentrify являются передовыми в области контроля привилегированных пользователей и имеют широкие аналитические возможности. \nThycotic обеспечивает безопасность привилегированного доступа к аккаунтам для более чем 12500 организаций по всему миру, включая 20% предприятий из списка Fortune 500, и является лучшим вариантом для защиты критически важных ресурсов в ИТ-инфраструктуре.    \n2 марта 2021 завершился процесс слияния Centrify с Thycotic. Такая комбинация создает самую обширную платформу на рынке защиты идентификационной информации, объединяя дополнительные возможности продукта, лучшие в своем классе технологии и непревзойденный опыт, чтобы эффективнее реализовать и защитить современное гибридное предприятие. ThycoticCentrify лидирует благодаря принципам применения прогрессивных технологических инноваций, усиления киберзащиты Клиентов и привлечения ведущих специалистов в области кибербезопасности.\nОсновные преимущества ThycoticCentrify\n    •  Сочетает в себе лучший в отрасли функционал по безопасности привилегированных учетных записей, защиты паролей, безопасности конечных точек и контроля приложений для Windows и Unix систем;\n    • Значительно снижает риски, останавливая развитие вредоносных атак на конечных точках и серверах, ограничивая возможность злоумышленников выходить за пределы начальной точки атаки, а также предотвращая установку средств удаленного доступа (RAT);\n    •  - Обеспечивает безопасную защиту учетных данных привилегированных учетных записей, предотвращая эскалацию привилегий путем удаления и/или ограничения их для бизнес-пользователей и ИТ-администраторов без снижения производительности; \n    • В дополнение к управлению привилегиями, решение также предоставляет функционал управления приложениями. Он предназначен для управления и контроля санкционированности запуска приложений на конечных точках и серверах, а также для предотвращения проникновения вредоносного ПО в инфраструктуру.\n    • В отличие от других решений по обеспечению безопасности, продукты ThycoticCentrify - быстрые в развертывании и проще в использовании, легко масштабируются до глобального корпоративного класса, а также предлагаются по конкурентной цене. \n Мировое признание \nThycotic и Centrify  - признанные мировые лидеры в области Privileged Access Management. Вот только некоторые награды, полученные в 2021 году:\n    • Thycotic и Centrify - снова были признаны лидерами PAM в “Магическом квадранте” Gartner 2021;\n    • Thycotic был назван золотым победителем в категории ‘Hot Company of the Year – Cloud/SaaS’ на вручении 16-й ежегодной премии IT World Awards®. Компания также была названа бронзовым победителем в категории ‘Cloud Security’;\n    • Сentrify был назван победителем Global InfoSec Awards на конференции RSA 2021;\n    • Thycotic выиграл третью подряд награду NorthFace ScoreBoard за высокое качество обслуживания клиентов.\n    \nКроме того, Thycotic и Centrify признаны лидерами в области Privileged Access Management в отчете 2021 Leadership Compass for PAM от Компании KuppingerCole.\nНесмотря на слияние Thycotic и Centrify в марте 2021 года, компания KuppingerCole оценивала их по отдельности для отчета 2021. Неудивительно, что и Thycotic, и Centrify, снова были названы Тотальными лидерами, а также заняли первые позиции в основных категориях: лидерство в продуктах, лидерство в инновациях и лидерство на рынке. Обе компании также признаны лидерами во всех матрицах коррелированных представлений, включая «Чемпионов рынка», «Лидеры технологий» и «Крупные компании», которые включают матрицу инноваций / рынка. \nОдин интересный рисунок в отчете фокусируется на широте возможностей конкретных решений PAM в виде «паучьей диаграммы», оценивающей каждого поставщика по восьми ключевым категориям. Показанный паучий график помогает проиллюстрировать, насколько основательно решения Thycotic управляют этими категориями, начиная от управления привилегиями конечных точек и заканчивая оперативным доступом, аналитикой и отчетностью.\n\n\nЛокальная команда Oberig IT, официального дистрибьютора ThycoticCentrify в Украине, готова поддерживать и консультировать партнеров и заказчиков\nПолучить доступ к экспертизе и тестированию решений ThycoticCentrify могут и украинские компании. Организацией и проведением пилотных проектов в Украине занимается официальный дистрибьютор ThycoticCentrify — компания Oberig IT. Подключение специалистов дистрибьютора к каждому проекту является стандартным подходом Oberig IT, несмотря на то, что поставка решений заказчикам выполняется исключительно при помощи авторизованных реселлер-партнеров. По всем вопросам можно обращаться [email protected].\n \nПубликуется на правах рекламы\nDell PowerStore – абсолютная готовность к инновациям в IT\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["2021", "г."], "time": null}, {"url": "https://ko.com.ua/wi-fi_povyshaet_jenergojeffektivnost_umnogo_doma_139872", "title": "Wi-Fi повышает энергоэффективность умного дома", "img": "https://ko.com.ua/files/u16/aristonvelis.jpg", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nИнформационные технологии активно входят в нашу повседневную жизнь, предлагая функциональность, которую прежде даже сложно было представить. Ярким примером тому являются элементы умного дома, позволяющие удаленно управлять через Wi-Fi различными бытовыми устройствами, например электрическим водонагревателем. Это дает ряд преимуществ не только конечному потребителю, но и сервисным организациям\nПонятие умный дом становится все ближе для самого широкого круга потребителей. В их обиход активно входят устройства, позволяющие проводить как удаленное управление, так и мониторинг состояния посредством интернет-подключения. Такую функциональность получили и стиральные машины, и климатическая техника. Даже пылесосы стали роботизированными. В настоящее время по своей динамике развития сфера IoT (Internet of Things, Интернет вещей) даже опережает многие другие направления на рынке информационных технологий.\n\n\nОдной из причин такого быстрого роста стало широкое внедрение подключения посредством Wi-Fi вместо закрытых протоколов. Таким образом были сняты ограничения, связанные со сложностью интеграции подобных решений. Согласитесь, сегодня беспроводные маршрутизаторы есть практически в любом доме, поэтому не представляет большой сложности включить в локальную беспроводную сеть любое устройство со встроенным адаптером Wi-Fi.\nСвой вклад в развитие концепции умного дома сделала и компания Ariston. В устройствах нового поколения этого производителя реализованы такие возможности по удаленному управлению, которые не только расширяют функциональность, но и улучшают энергоэффективность. Изучим подробнее, что это дает не только конечному потребителю, но и бизнесу.\nДовольно часто потребитель стремится выбрать наиболее доступную по цене бытовую технику, которая отвечает предъявляемым требованиям по функциональности и надежности. Но есть и такой важный фактор, как совокупная стоимость владения. Именно на него сделала основной акцент Ariston, внедрившая технологию Connectivity Arison NET в свои устройства для обеспечения домашнего обогрева и горячего водоснабжения. Рассмотрим предоставляемые ею возможности на примере водонагревателей нового поколения Velis Evo Wi-Fi.\nКонструктивно водонагреватель Velis Evo Wi-Fi выполнен в компактном корпусе глубиной не более 27 см. Его современный дизайн позволяет как горизонтальное, так и вертикальное размещение, что открывает возможности встраивания в практически любое окружение. Устройство доступно с вариантами объема 50, 80 и 100 литров. Но все же ключевой особенностью модели является наличие встроенного контроллера с адаптером Wi-Fi. Он удаленно взаимодействует с мобильным приложением. В отличие от обычных водонагревателей, которые постоянно включены, управляемый работает по заданному владельцем расписанию. Это ощутимо снижает энергопотребление, что особенно актуально в условиях постоянного роста тарифов, наблюдаемого в последнее время как в нашей стране, так и в Западной Европе. Все же как бы тщательно ни была подобрана термоизоляция бака с горячей водой, потери энергии постоянно включенного устройства в нерабочий период просто неизбежны. Если не полностью их исключить, то значительно сократить призвано удаленное управление через мобильное приложение Ariston Net.\n\n\nИнструмент дает в распоряжение пользователя несколько режимов, начиная от ручного включения-выключения, и заканчивая созданием недельного расписания. При этом устройство может получать извещения о достижении требуемой температуры воды в баке, оценки времени готовности к работе, а также предупреждения о возможных отказах устройства.\nСреди возможностей мобильного приложения Ariston Net стоит отметить формируемые в нем отчеты об энергопотреблении устройства за определенные периоды (день, неделя, месяц, год), а также рекомендации по повышению энергоэффективности. \nКроме таких выгод для конечного потребителя, как удобство и повышенная энергоэффективность, технология Connectivity Arison NET также позволяет наладить удаленную диагностику. А значит сервисные партнеры производителя смогут обеспечить бесперебойную работу решения без дополнительных усилий, просто получая извещения о возможных отказах. При этом сервисный инженер будет отправляться по вызову уже с необходимыми запасными частями. \nПроцедура подключения с помощью технологии Connectivity Arison NET весьма проста и включает три шага: настройку конфигурации для подключения к Wi-Fi, регистрацию аккаунта, а затем подсоединение аппарата и потребителя к сервису. Как видим, все очень просто, не требуя каких-то сложных манипуляций от сервисного персонала.\n\n\nТакже стоит отметить, что в ответ на быстрорастущую глобальную тенденцию в области умного дома Arison продолжает инвестировать в расширение готовых к подключению решений. И тут, как отмечают, представители компании, задача двоякая: увеличить количество подключенных клиентов и обеспечить постоянное взаимодействие с ними. Очевидно. что обеспечение долгосрочной лояльности клиентов возможно за счет достижения высокого уровня удовлетворенности пользователей, а также постоянного использования сервисов с возможностью подключения в течение продолжительного времени. На данный момент у компании существует три таких сервиса:\n• Ariston NET - это потребительское приложение, позволяющее удаленно управлять решениями для обогрева помещений и нагрева воды, снижая потребление энергии и непрерывно контролируя работу системы. Собственно тот сервис и приложение, которое мы рассмотрели\n• Ariston NET PRO - платформа удаленной веб-поддержки для профессионалов, которая позволяет повысить операционную эффективность, одновременно увеличивая клиентскую базу и повышая лояльность клиентов. \n• Ariston NET OPEN - новый и более инновационный подход, который открывает путь к взаимодействию и интеграции подключенных сервисов Ariston в веб-приложения и мобильные приложения, а также в продукты сторонних производителей.\n\n    • 99% центров поддержки удовлетворены Ariston NET Pro \n    • 50% центров поддержки сообщают об увеличении оборота, связанном с Ariston NET Pro и услугой удаленной диагностики \n    • 80% центров поддержки заявляют, что их работа по техническому  обслуживанию стала более эффективной из-за снижения потребности в  обращений в службу поддержки, что приводит к значительной экономии  времени. \n \n\n\nВ контексте развития умного дома важным является обеспечение функциональной совместимости, а также использование унифицированных интерфейсов. Например, продукты рассматриваемого производителя поддерживают Amazon Alexa, Apple Homekit и Google Assistant через Ariston NET, что позволяет интегрировать системы компании с ведущими платформами для умного дома.\nЕще один важный момент внедрение цифровых инструментов требует поддержания высокого уровня безопасности используемого программного обеспечения и сервисов. В 2015 году Ariston создала специальное организационное подразделение, которое концентрируется на вопросах кибербезопасности продуктов компании.\nПодводя общий итог знакомству с новыми возможностями, предоставляемыми решениями Arison для умного дома, отметим, что они уже успешно приняты западноевропейскими потребителями. А значит и украинские быстро поймут все преимущества удаленного управления с помощью технологии Connectivity Arison NET.\nDell PowerStore – абсолютная готовность к инновациям в IT\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "Тимур Ягофаров", "date": ["2021", "г."], "time": null}, {"url": "https://ko.com.ua/yak_pobuduvati_efektivnu_sistemu_informacijnoyi_bezpeki_v_umovah_neodnoridnosti_biznes-napryamkiv_velikogo_holdingu_139831", "title": "Успішний кейс побудови ефективної кібербезпеки для групи компаній", "img": "https://ko.com.ua/files/u16/1200Х628_MTI.jpg", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nІнформаційна безпека – це неминуче комплекс заходів та технологій, які мають впроваджуватися згідно з чітким планом та доповнювати одне одного. Розробники активно акцентують увагу на тому, як їхні рішення «уживаються» з інфраструктурою компанії, але в процесі вибору конкретних продуктів бізнесу доводиться шукати відповіді на безліч інших питань.\n\nЯк усе працює на практиці, з чого краще почати і скільки це коштує — запитали Андрія Кононцева — людину, яка відповідає за інформбезпеку великого холдингу.\nАндрію, наскільки складно забезпечувати безпеку в такій великій компанії?\nТака роздробленість та неоднорідність напрямків нашого бізнесу дуже позначається на вимогах до безпеки. Вибираючи будь-які рішення для ІБ або ІТ, ми обов'язково маємо враховувати не лише завдання конкретної компанії холдингу, а ще і її місце у загальній інфраструктурі. Наприклад, захист кінцевих точок має однаково добре працювати на комп'ютері як менеджера роздрібного магазину, так і Sales Manager`a IT-дистриб'ютора, бухгалтерів, ІТ-співробітників чи керівників. Комп'ютерна техніка, використовуване ПЗ та знання в ІТ сфері різні, а справлятися з усім має єдина система безпеки. Тим паче, що типи загроз, частота атак та їх специфіка є багатоманітними.\nЯкі відділи займаються безпекою?\nБезпека — це цілий окремий кластер у структурі компанії, завдання якого в напрямку кібербезпеки хоч і перегукуються із завданнями IT-відділу, але здебільшого все ж таки відрізняються як у технічному плані, так і в самій суті. Раніше захистом кінцевих точок та мережі займався IT-підрозділ. Зі зростанням загроз, появою нових рішень та аналізу ризиків ІБ ми зрозуміли, що для оперативного реагування на сучасні кіберзагрози потрібно займатися безпекою не за залишковим принципом, а насамперед. Та й по суті, на ІТ лежать питання підтримки інфраструктури, щоб все працювало, вчасно лагодилося і т.д. Тому ми вирішили провести невелику реформу та перемістити всю технічну безпеку до відділу інформаційної безпеки.\nНещодавно ви впровадили рішення для захисту даних у хмарі (CASB) та виявлення загроз на кінцевих точках та реагування на них (EDR). Розкажіть, як дійшли необхідності цих рішень?\nМи досить довго йшли до тієї інфраструктури, яку маємо зараз. Спочатку це були спроби роботи з хмарними ресурсами, потім повальна міграція сервісів у хмари. З переходом у хмари ми мали терміново розібратися, як забезпечувати якісний захист та розуміти, що відбувається з нашими даними. Насамперед цей запит надійшов від бізнесу, для підвищення гнучкості та оптимізації бізнес-процесів. Перед нами гостро постало питання – як забезпечити безпеку даних у хмарах в тому числі для сервісів Office 365, контроль переміщення даних та розмежування доступу, де б не знаходилися користувач та пристрій (на роботі чи вдома).\nВирішили не формувати розрізнену інфраструктуру безпеки, оскільки для її супроводу потрібно більше ресурсів і ,насамперед, більше фахівців. Тому спочатку, проаналізувавши рішення кількох виробників, вирішили будувати безпеку на продуктах McAfee Enterprise. Відповідно, масштабувати безпеку також вирішили з використанням продуктів цього виробника. Так у нас з'явився весь антивірусний комплекс із захисту кінцевих точок. Пізніше, як я вже казав, ми почали активно використовувати хмарні послуги, і тому нам знадобився брокер безпечного доступу до хмар. CASB від McAfee Enterprise — це лідер у даному класі рішень, що тоді, що зараз.\nАле антивірусний захист на землі та у хмарі –- це лише частина безпеки. Складність та кількість векторів атак значно зросла за останній час. Для нас стало очевидним, що рішення захисту, хай навіть «просунутий антивірус», не можуть дати повної видимості того, що у нас відбувається в мережі та на кінцевих точках. За допомогою нього не можна побудувати форензику та повноцінно розслідувати інциденти ІБ. І воно по суті для цього і не призначено. Тому ми вирішили впровадити EDR. З таким набором інструментів ми були готові до всього, і пандемія не застала нас зненацька. Протягом одного дня ми змогли перейти на віддалений режим роботи.\nЯкі критерії були важливими при виборі CASB та EDR?\nНа нашому ринку все ж таки перше місце займає ціна — багато компаній не можуть дозволити собі колосальних витрат на безпеку, а тому іноді змушені йти на компроміси у вигляді опенсорсних рішень. У нас теж не було повної фінансової свободи, але бюджет дозволяв обрати рішення у кращому співвідношенні ціна/якість. Продукти McAfee Enterprise завжди знаходяться в лідерах на ринку і часто виявляються значно доступнішими за конкурентів.\nНаступний критерій – можливість інтеграції з іншими компонентами інфраструктури. Без такої гнучкості безпека буде не єдиною логічною системою, а просто незв'язаним набором інструментів, що, певна річ, знижує ефективність безпеки в цілому. Інтеграція рішень «з коробки», у разі McAfee, не тільки прискорює виявлення складних загроз, але й дає можливість автоматизації для швидкого реагування на них.\nЗамикає трійку, зрозуміло, функціонал самого продукту. Одним з головних завдань у нас є контроль та захист данних у хмарах. Пілот рішення CASB від McAfee показав, що продукт має широкий функціонал і, що важливо, зручний інтерфейс. Яскравий приклад використання - це Office 365. Також нас привабило те, що рішення є абсолютним лідером за результатами оцінки Gartner.\nЯкими були альтернативні варіанти рішень безпеки?\nНа перший погляд, альтернатив здавалося багато. Потім, коли почали заглиблюватися в рішення інших виробників, виявилося, що багато продуктів ще не такі «зрілі». Зараз багато виробників розширюють свої продуктові лінійки, але їхні продукти на етапі виведення на ринок можуть мати досить низьку і привабливу вартість. А ось їхні можливості далеко не завжди вирішують актуальні завдання безпеки. З етичних норм не буду називати назви компаній.\nМи зупинилися на 2-3 виробниках. Зваживши всі фактори після проведення пілота, ми вибрали рішення McAfee Enterprise. Одним з важливих факторів було те, що McAfee має досить сильні рішення як для захисту кінцевих точок, так і для захисту хмари. До того ж, вся система вже спиралася на McAfee і ми вирішили не витрачати час та кошти на перенавчання фахівців без вагомих переваг.\nЯк пройшло впровадження рішень?\nЗ впровадженням CASB, EDR та інших продуктів вендора жодних проблем не було. Щодо CASB зазначу, що велику роль відіграє докладна і зрозуміла документація — всі налаштування, схеми та варіанти інтеграцій вже надані «з коробки». Рішення CASB та EDR постачаються як SaaS і не вимагають встановлення серверної інфраструктури. Я сам усе інтегрував без додаткових навчань і створював початкові політики. Там немає якихось серйозних складнощів.\nПотішило те, що всі наші напрацювання з пілотної версії перейшли до платної ліцензії, тож нам не довелося починати з нуля.\nДо речі, чи легко управляти одразу всіма системами безпеки?\nЗручне управління, напевно, один із тих критеріїв, на яких базувався наш вибір. У McAfee це вирішується за допомогою ePolicy Orchestrator – єдиної консолі для управління всіма рішеннями безпеки. Оскільки для нас є актуальним завдання впоратися з різними рішеннями для захисту інфраструктур неоднорідних компаній, така оркестрація стає обов'язковою. Управління з єдиної точки ми давно визначили як критерій відбору будь-якого захисту.\nЩо ви особисто відзначили в продуктах McAfee?\nВпроваджуючи CASB, ми потребували брокера безпечного доступу до хмар і більш детального контролю в O365 за помірні витрати. Іноді впровадження чогось нового додає нових проблем із продуктивністю та дає навантаження на систему. Як результат – ІБ та IT починають конфліктувати та з'ясовувати пріоритети. Але McAfee не навантажує інфраструктуру та дозволяє всім спокійно працювати.\nРішення CASB зручне, оскільки політики швидко та легко налаштовуються, їх можна підігнати під себе до дрібниць, підв'язати пристрої тощо. Іншими словами, це не забирає багато часу. \nЗрозуміло, ідеальних систем не існує, і бувають профілактики, оновлення та якісь нюанси. Але головне – проблеми трапляються нечасто, а вендор швидко на них реагує.\nЩодо рішення EDR скажу, що воно дуже розширює можливості захисту та дійсно допомагає в роботі. EDR значно підвищує видимість того, що відбувається, підвищує можливості для оперативного блокування процесів або переміщення до «карантину» ураженої робочої станції, спрощує визначення зв'язків між подіями безпеки та дає можливість швидко вживати заходів.\nЯкі інші інструменти McAfee ви використовуєте?\nMcAfee має MVISION Insights, який у нас теж включений у функціонал. Хоча, на перший погляд, це досить факультативне рішення (воно безпосередньо нічого не захищає і не блокує), практичної користі від нього значно більше, ніж може здатися.\nЯ б сказав, що це рішення стосується проактивного захисту. По-перше, MVISION Insights перевіряє вас ще раз, тобто, по суті проводить аудит політик безпеки. Якщо фахівець забув активувати якусь функцію, безпекову політику або десь не встановив продукт, критично важливий для відбиття атак — рішення це помітить і сповістить його.\nПо-друге, воно замінює купу підписок на різні новини та інші ресурси. Ви дізнаєтесь, як змінюється ландшафт загроз у світі, в Україні, за напрямами бізнесів. Ви отримаєте повну інформацію про їх маркери компрометації, цілі атак, а також дані від інших вендорів по цим атакам. У самому рішенні ви зможете порівняти отриману інформацію з MITRE ATT&CK та оцінити, яка з атак є потенційною загрозою для вашої компанії.\nЯк би ви резюмували ваші враження від використання комплексу рішень безпеки від McAfee?\nЯ назвав би рішення McAfee конструктором, де багато залежить від самих фахівців і того, як вони спроєктують захист. У цьому сенсі архітектура рішень та підходи – це фундамент, на якому будується безпека. Спочатку ми для себе відзначили, що з платформою безпеки та підходами McAfee ми зможемо забезпечити інтеграцію рішень, а отже, і автоматизацію з реагування на атаки. На етапі, коли ми визначали стратегію розвитку безпеки, ми вирішили, що для нас це важливо. Якщо до цього питання спочатку не підійти системно, можна отримати «зоопарк» з різних рішень, а разом з тим – непов'язану та неефективну інфраструктуру безпеки.\nНа базі продуктів McAfee можна будувати ешелонований захист на різних рівнях, при цьому зручно управляти і все налаштовувати з однієї консолі. У рішень є синергія. При цьому окремі продукти теж досить ефективні, тому вирішити можна абсолютно будь-які завдання безпеки.\nНаразі ми вже маємо комплекс безпеки. Але ми бачимо, що нам не вистачає Пісочниці та SIEM, тож розмірковуємо над їх придбанням. Я радий, що керівництво з розумінням ставиться до наших ініціатив та проєктів щодо розвитку ІБ, адже від безпеки насамперед залежить стабільність бізнес-процесів.\n\nГрупа компаній MTI — це диверсифікований бізнес, який об'єднує три базові напрямки:\n - інформаційно-комунікаційні технології, такі як дистрибуція,  гарантійний та післягарантійний сервіс, проєктування і впровадження  систем безпеки (антикрадіжних систем, систем контролю доступу,  управління складом на базі RFID-технології)\n- роздрібна торгівля (взуття, одяг, ювелірні прикраси, електроніка)\n- 3-PL оператор (послуги зі зберігання, обробки та доставки вантажів).\n\n\nDell PowerStore – абсолютная готовность к инновациям в IT\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "Михаил Лаптев", "date": ["2021", "г."], "time": null}, {"url": "https://ko.com.ua/karlis_lucs_qnap_v_ukraine_nash_biznes_za_poslednij_god_vyros_na_30_139829", "title": "Карлис Луцс, QNAP: «В Украине наш бизнес за последний год вырос на 30%»", "img": "https://ko.com.ua/files/u16/Karlis Qnap.jpg", "body": "\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\nСегодня у нас в гостях Карлис Луцс, региональный менеджер по развитию бизнеса QNAP в Балтике и СНГ. На разговор мы начали с вопроса о том, как повлияла и влияет пандемия на работу компании, специализирующейся на выпуске сетевых хранилищ (NAS). Кстати, название компании - QNAP - это аббревиатура Quality Network Appliance Provider.\nТак совпало, что жесткие ограничения по командировкам в нашей компании были внедрены в Тайване, но не коснулись лично меня. Поэтому, несмотря на пандемию, в этом году удалось активно выступать на дистрибьюторских и партнерских мероприятиях в разных городах региона, который я курирую. При этом я был готов столкнутся с консервативным поведением партнёров по отношению к посещению мероприятий и назначению встреч. Но, наверное, со временем мы все привыкаем к новым условиям жизни и личностное общение ни что не может заменить. Признаюсь, в разрешенные периоды количество встреч и мероприятий было больше, чем до наступления covid-19. Мы очень активно развивали бизнес в последние полтора года, как раз в период, когда начались ограничения. Безусловно, сложившаяся ситуация наложила свой отпечаток на многие процессы - добавилась сложность в составлении прогнозов, обеспечении логистики, возник дефицит на многие компоненты. Но при этом появились новые возможности для компаний, активно работающих над поставками элементов ИТ-инфраструктур. Активный спрос на цифровизацию стимулировал многие направления ИТ-рынка и поднял востребованность действительно необходимых и работающих решений.\n\n\nКак изменился спрос на предлагаемые вами системы в нашем регионе?\nПрежде всего отмечу, что спрос уверено растет. Из года в год наш бизнес в странах бывшего СНГ в целом (кроме РФ, Беларуси и Казахстана, за развитие которых я не отвечаю) увеличивается в среднем на 50%. Мы традиционно развиваемся в двух ключевых направлениях – в проектном бизнесе и в продажах потребительских продуктов. По первому направлению основой является наша надежная и прозрачная регистрация проектов, а также стимулирование партнеров за их вклад в рост нашего совместного бизнеса. В потребительском сегменте мы смогли обеспечить стабильную доступность наших младших моделей на протяжении всего года, при этом цены на них для дистрибуторского канала практически не изменились даже в этих условиях. \nИнтересно также отметить, что во второй половине года наши основные конкуренты в определенном смысле начали копировать наши активности – как маркетинговые, так и, например, в контексте соглашений с новыми бизнес-партнёрами. Это всё подчеркивает то, что мы ещё в 2020-ом году выбрали правильную стратегию и запускаем оптимальные активности для развития нашего бизнеса и сегмента NAS/NVR в целом. Но и у конкурентов всегда можно чему-то научиться и моё личное пожелание на 2022 год – пусть конкуренты также создадут что-то такое, чему сможем поучиться и мы.\nКакие из продуктов компании, которые вышли в 2021 г., вы могли бы особо отметить?\nГлобально мы наблюдаем стремительный рост в развитие розницы и спрос со стороны этого сегмента. Например, одна из задач - подсчет количества покупателей в магазинах и отслеживание их поведения. В этом контексте наши инженеры ещё в начале года разработали приложение QVR Human, которое мы поставляем с нашими NVR-устройствами. Более того, эти системы получили также функциональность распознания лиц людей в масках, прикрывающий их рот и нос (решения QVR Face Link).\nQNAP начал основательно развивать сегмент Ethernet коммутаторов и аксессуаров для заметного ускорения работы локальных сетей, соединяющих сервера с клиентскими устройствами. На сегодняшний день мы производим около 20 разных Layer 2 управляемых и неуправляемых коммутаторов, а так же 5 PoE-коммутаторов. В условиях сильной глобальной нехватки материалов для производства коммутаторов QNAP уверено выходит на рынки Украины и страны бывшего СНГ с этой продукцией.\nТак же мы уверено продолжаем развивать продуктовую линейку NAS под названием «QuTS hero» - эти устройства построены на Z-файловой системе (ZFS). Они особенно актуальны для критически важных сред, где приоритетом является обеспечение максимально быстрого и эффективного сжатия бэкапов, а так же там, где важно предотвратить «тихие» повреждения жестких дисков и твердотельных накопителей. На сегодняшний день мы можем предложить Заказчику 15 разных NAS на базе ОС QuTS Hero и количество этих решений будет только расти.\nЧто ещё интересно – мы не побоялись выпустить первое TVS-устройство под задачи NVR, которое построено не на процессорах от Intel или AMD. Наша компания в этом году представила систему NVR TVS-675-8G, оснащенную 8-ми ядерным и 8-ми потоковым китайским процессором от Zhaoxin KaiXian. Это позволило предложить NVR по цене, которая на 70-80% ниже NAS, построенного на Intel Core i5. \nА какие бы тренды вы отметили на мировом рынке в вашем сегменте?\nНачнем с того факта, что СХД и бэкапы стали более уязвимыми, чем когда-либо. Интересное исследование представила компания Continuity в октябре. Оно показывает, что в современных СХД от А-брендов можно найти в среднем около 15 уязвимостей, из которых 3 представляют высокий или критически высокий риск, что подразумевает высокую вероятность взлома. В последнее время вирусы-вымогатели стали крайне прибыльным бизнесом, хотя этот тренд начался ещё когда биткоин начал набирать популярность в начале 2010-ых. Увы, глобальные кибервзломы не миновали и наши устройства - в апреле мы были атакованы вирусом-вымогателем Qlocker. Да, на изучение и создание решения ушло около 4-х дней, но наша команда успешно справилась с этой задачей и всем пострадавшим пользователям была предложена специальная инструкциа для самостоятельного восстановления данных, в крайне редких случаях наши инженеры подключались к этому процессы. И тут важно понимать – пострадали исключительно те устройства, прошивка которых не обновлялась месяцами, а то и годами. Тут нужно абсолютно отдавать себе отчет, если мы не будем обновлять свои устройства, то можем подвергнуться атаке в любой момент, и необходимо осознавать все риски. И еще важно понимать, что «на той стороне экрана» работают целые команды, имеющие необходимые знания, мотивацию и инструменты для взлома различных устройств. Когда речь идёт о взломах СХД – для всех это становится сверх чувствительной темой, так как речь идет о потери данных, зачастую очень критичных для бизнеса.\n\n\nВ контексте глобальных технологических трендов – необходимо также отметить актуальность использования гибридных СХД, которые предлагают пользователю как файловый сервер, так и хранилище объектов (object storage), и блочный storage. В действительности, пользователь, используя один интерфейс QNAP File Station может с легкостью управлять всеми вышеназванными типами хранения данных.\nТак же хочу напомнить, что сегмент All-flash NAS уверено растет и согласно последним данным Mordor Intelligence его рост CAGR в ближайшие 5 лет составит 13,67%. Основные двигатели здесь – потребление меньшего количества энергии, высокая производительность, масштабируемость и удобство в использовании. Вместе с этим мы всё чаще встречаем All-flash NAS базирующиеся на NVMe накопителях. Например, наш TS-h2490FU поддерживает установку 24-х U.2 или M.2 накопителей и способен достигнуть более 650К IOPS. \nИ заключительный вопрос - о динамике продаж на нашем рынке и ваших планах?\nВ Украине наш бизнес за последний год вырос на 30% и потенциал, по нашим оценкам, имеется во всех сегментах, где мы работаем. Так что нам есть куда расти и мы шаг за шагом двигаемся вперед. Приятно отметить, что в проектном бизнесе мы не только занимаем лидирующее место, но получаем очень позитивный фидбек от наших партнеров разного уровня. Ведь бизнес делают люди и это здорово, если наш подход к бизнесу позволяет нам так же развивать отношения на персональном уровне. Я уверен, что мы сможем добиться  лучших результатов и развить наш успех, поскольку спрос на наши решения будет только расти.\nДополнительную информацию о компании и ее решениях вы можете найти на специальной странице http://ko.com.ua/qnapDell PowerStore – абсолютная готовность к инновациям в IT\n+44голоса\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["2021", "г."], "time": null}, {"url": "https://ko.com.ua/synology_rackstation_rs1221rp_stoechnoe_hranilishhe_dlya_smb_139731", "title": "Synology RackStation RS1221RP+: стоечное хранилище для СМБ", "img": "https://ko.com.ua/files/u16/Synology RackStation RS1221RP front.jpg", "body": "\n+35голосов\n\n\n\n\nTweet\n\n\n\n\n\nСтремительно нарастающий объем информации в бизнес-среде требует внедрения надежных сетевых хранилищ не только в крупных корпорациях, но и в предприятиях меньшего масштаба. Рассматриваемое решение наделено возможностями, которые могут оказаться полезными при построении ИТ-инфраструктур средних и малых компаний.\nКомпания Synology выпускает достаточно широкий модельный ряд сетевых хранилищ, но мы решили начать знакомство с ними с устройства, которое производитель позиционирует в качестве решения начального уровня для бизнеса. Модель Synology RackStation RS1221RP+ интересна еще и тем, что это один из первых NAS в своем классе, базирующийся на платформе AMD Ryzen. \nДавайте остановимся на конструктивных особенностях данного NAS. Модель Synology RackStation RS1221RP+ выполнена в стоечном исполнении высотой 2U, при этом ее глубина составляет до 38 см, что позволяет разместить систему в весьма ограниченном пространстве. Все восемь отсеков для размещения накопителей форм-факторов 3,5 и 2,5 дюйма доступны с передней панели.\n \n \n\n\n \n \nСетевое хранилище Synology RackStation RS1221RP+ можно приобрести за 47400 грн \n\n\nАппаратная платформа сетевого хранилища включает четырехядерный процессор     AMD Ryzen V1500B с тактовой частотой 2,2 ГГц и 4 ГБ оперативной памяти DDR4 ECC SODIMM. Благодаря наличию двух слотов ОЗУ может быть увеличена до 32 ГБ. В платформе имеется один слот PCIe Gen3 x8 для установки карт расширения. Это может быть, например, кэширующий твердотельный накопитель или сетевая карта 10 GbE. Набор сетевых портов включает четыре разъема RJ-45 1GbE с поддержкой функции Link Aggregation для защиты подключения к локальной сети от выхода из строя. Гарантированное энергоснабжение обеспечивается блоком питания мощностью 350 Вт с резервированием. \nФункциональность решения определяется программной платформой Synology DiskStation Manager. Среди ее возможностей стоит отметить Hyper Backup – комплексное решение для резервного копирования и восстановления. Оно предусматривает возможность размещения места назначения резервного копирования как локально, так и на другом устройстве Synology, серверах rsync или в облачных системах хранения, таких как Google Drive, Dropbox, хранилища, совместимые с S3, и Synology C2 Storage. Используемые при этом функции дедупликации, проверки целостности и технология инкрементной передачи данных сокращают потребление ресурсов полосы пропускания и хранения.\n\n Функциональность Hyper Backup \nПоскольку исследуемое сетевое хранилище ориентировано на бизнес-сферу, в нем реализована работа с платформами виртуализации. Интеграция VMware vSphere 6 и VAAI помогает разгрузить операции обращения к хранящимся в виртуальной машине данным. Поддержка технологии Windows Offloaded Data Transfer (ODX) ускоряет передачу информации. Возможность работы с OpenStack Cinder превращает систему Synology NAS в компонент блочного хранилища.\nКлючевым приложением в оснащении сетевых хранилищ Synology является пакет DSM. Его функциональность охватывает широкий спектр задач. Поскольку рассматриваемое нами решение ориентировано на бизнес, остановимся на тех возможностях  DiskStation Manager, которые нацелены на деловую сферу. И в первую очередь, стоит отметить Active Backup for Business. Данный инструмент позволяет выполнять резервное копирование как всего Windows сервера, так и виртуальных машин VMware и Hyper-V. Причем нет никаких ограничений по количеству резервных копий для платформ под управлением операционных систем Windows и Linux, впрочем и сама утилита Active Backup for Business предоставляется бесплатно.\n\n Настройка Hyper Backup предусматривает широкие возможности\n\nВ рамках Active Backup for Business операции резервного копирования выполняются с применением технологии дедупликации. Это дает ощутимую экономию пространства за счет удаления идентичных блоков данных в разных версиях резервных копий.\nРешение Active Backup for Microsoft дает возможность централизовано выполнять резервное копирование учетных записей Microsoft 365 на NAS, чтобы обеспечить непрерывный доступ в случае непредвиденных событий. При этом под защитой оказываются все критически важные данные в OneDrive for Business, SharePoint Online, Exchange Online и Teams. Как и предыдущие инструменты, Active Backup for Microsoft предлагается бесплатно и не предусматривает каких-либо ограничений по числу резервных копий.\n\nНастройка SSD-кэширования предусматривает выделение системной памяти \nТакже бесплатно на сетевых хранилищах Synology доступен Active Backup for Gsuite, который предназначен для резервного копирования платформы Google Workspace с соблюдением всех политик хранения данных. Они могут быть получены из Google Drive, Gmail, Контактов и Календаря. \nТехнология репликации мгновенных снимков (Snapshot Replication) стала особенно востребованной в последнее время в связи с получившими широкое распространение программами-вымогателями. Поддерживается она и в сетевых хранилищах Synology, используя современную файловую систему Btrfs для создания точных копий общих папок и блоков LUN, которые можно реплицировать на другие сетевые хранилища Synology и быстро восстановить в случае потери данных или случайного изменения исходных данных. Производитель заявляет о возможности выполнения моментального снимка и репликации раз в 5 минут для общих папок и раз в 15 минут для блоков LUN. Аварийное восстановление возможно и для платформ виртуализации на VMware vSphere и Microsoft Hyper-V.\n\n Распределение памяти при SSD-кэшировании \nСтоит упомянуть и используемую в сетевых хранилищах Synology технологию SSD-кэширования, которая нацелена на ускорение работы с файлами небольшого размера. Программная платформа предоставляет возможность настройки такого кэширования как только для чтения, так и для чтения и записи. Для этого используется инструмент SSD Cache Advisor, который позволяет в течении определенного времени проанализировать нагрузку ввода/вывода и дать рекомендации по формированию SSD-кэша. По заявлению производителя, такой анализ желательно проводить не менее 7 дней, а его если не отключать вручную, то режим анализа завершится автоматически через 30 дней. \nМы провели соответствующую настройку, результаты которой приведены на иллюстрациях. Стоит иметь в виду, что при формировании SSD-кэша необходимо выделить и определенный объем оперативной памяти.\nВ сетевых хранилищах Synology поддерживается протокол iSCSI, настройка работы с которым подробно описана в онлайновом центре знаний компании.     \n\n SSD-кэширование включено \nЕще один чрезвычайно полезный системным администраторам инструмент – Active Insight. Он обеспечивает автоматический мониторинг, анализ ресурсов, диагностику аномалий и выдачу рекомендаций по поиску и устранению неисправностей, чтобы обеспечить работоспособность и производительность системы NAS Synology. Все это происходит в облачной среде и в режиме реального времени. Все зарегистрированные в учетной записи Synology сетевые хранилища представлены на одном экране, куда поступают уведомления о событиях. \nПодводя итоги исследования сетевого хранилища Synology RackStation RS1221RP+, можно отметить, что оно полностью отвечает требованиям по оснащению, которые предъявляются к устройствам начального уровня для бизнеса. Во время тестирования мы не столкнулись с какими-либо проблемами настойки платформы. А широкая функциональность предлагаемого для сетевых хранилищ Synology программного обеспечения упрощает управление ими и выполнение часто встречающихся задач резервного хранения, в том числе, и в облачной среде.\nПубликуется на правах рекламы\nDell PowerStore – абсолютная готовность к инновациям в IT\n+35голосов\n\n\n\n\nTweet\n\n\n\n\n\n", "author": "КО", "date": ["2021", "г."], "time": null}]